START_MESSAGE = """<b>👋 Привет!</b>

<i>Я - Flattery, нейросеть по подбору квартир. Загрузите картинку квартиры, которая Вам нравится, и посмотрите, что предложит бот!</i>"""

SEARCH_BUTTON = "🔎 Подобрать квартиру"
SEARCH_TEXT = """🔎 <b>Подбор квартиры:</b>

<i>Пришлите фотографию-пример квартиры:</i>"""

INFO_BUTTON = "ℹ️ Информация"
INFO_TEXT = """Это MVP для проекта Flattery — нейросети по подбору квартир. Загрузите картинку квартиры, которая Вам нравится, и посмотрите, что предложит бот!"""

TEXT_NOT_RECOGNIZED = "❌ Ошибка! Текст не распознан!"

FLAT_TEXT = """<b>🏠 Квартира #{ID}</b>
<i>
<b>Ⓜ️ Метро:</b> {METRO}
<b>📏 Количество комнат:</b> {SIZE}</i>"""

GO_LINK_BUTTON = "🔗 Перейти на страницу"

LEFT = "⬅️"
RIGHT = "➡️"

FLAT_FOUNDED = "✅ Квартиры найдены:"
PHOTO_UPLOADED = "✅ Фото загружено! Ищу квартиры..."